testsuite/sysbench/results/oltp_insert.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 4645.28 qps: 4645.28 (r/w/o: 0.00/4645.28/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 4737.30 qps: 4737.30 (r/w/o: 0.00/4737.30/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 4701.55 qps: 4701.55 (r/w/o: 0.00/4701.55/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           284100
        other:                           0
        total:                           284100
    transactions:                        284100 (4733.83 per sec.)
    queries:                             284100 (4733.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4733.8264
    time elapsed:                        60.0150s
    total number of events:              284100

Latency (ms):
         min:                                    3.58
         avg:                                   13.51
         max:                                   51.15
         95th percentile:                       16.41
         sum:                              3839207.72

Threads fairness:
    events (avg/stddev):           4438.8906/9.74
    execution time (avg/stddev):   59.9876/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 4709.87 qps: 4709.87 (r/w/o: 0.00/4709.87/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 4706.76 qps: 4706.76 (r/w/o: 0.00/4706.76/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 4763.45 qps: 4763.45 (r/w/o: 0.00/4763.45/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           284280
        other:                           0
        total:                           284280
    transactions:                        284280 (4736.36 per sec.)
    queries:                             284280 (4736.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4736.3584
    time elapsed:                        60.0209s
    total number of events:              284280

Latency (ms):
         min:                                    3.39
         avg:                                   13.51
         max:                                   43.93
         95th percentile:                       15.83
         sum:                              3840249.41

Threads fairness:
    events (avg/stddev):           4441.8750/18.96
    execution time (avg/stddev):   60.0039/0.00